Revit 2027 API
LinkLoadResultType Enumeration
 Enum listing the possible results after loading a linked model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LinkLoadResultType
Public Enumeration LinkLoadResultType
public enum class LinkLoadResultType
type LinkLoadResultType
Members
Member name | Value | Description
CouldNotChangeViewReference | 12 |  The link previously had an invalid view reference and either no new view was provided or the input view was not usable for linking CAD files.
ExternalServerMissing | 9 |  The external add-in required to load this link model could not be found.
LinkExists | 10 |  Revit already has a link with the input location, so no new link can be created.
LinkLoaded | 1 |  The linked model loaded correctly.
LinkMayBeUpgraded | 8 |  Point cloud link loaded correctly but is obsolete and may be upgraded.
LinkNotFound | 2 |  The linked model could not be found.
LinkNotLoadedOtherError | 7 |  An unknown error occurred.
LinkNotOpenable | 3 |  An error occurred trying to read the linked model. It could happen if a wrong link type is trying to be loaded.
LinkOpenAsHost | 4 |  The linked model is already opened directly in Revit.
SameCentralModelAsHost | 6 |  Either the linked model and its host document are both locals of the same central model, or one is a local and the other is its central.
SameModelAsHost | 5 |  The linked model has the same path as the currently active document.
Uninitialized | 0 |  Revit has not tried to load the link, possibly because it is a nested link and its parent failed to load.
UsedExisting | 13 |  Revit already has a link with the input location, so the same link is been reused.
Remarks
 For all values except LinkLoadResultType.LinkLoaded, the linked model is not loaded and no new link is created (if Revit was trying to create a link).
See Also
Reference
Autodesk.Revit.DB Namespace